{"weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"shape": [3, 3, 3, 64], "name": "conv1/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv1/bias", "dtype": "float32"}, {"shape": [1, 1, 512, 1000], "name": "conv10/kernel", "dtype": "float32"}, {"shape": [1000], "name": "conv10/bias", "dtype": "float32"}, {"shape": [1, 1, 16, 64], "name": "fire2/expand1x1/kernel", "dtype": "float32"}, {"shape": [64], "name": "fire2/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 16, 64], "name": "fire2/expand3x3/kernel", "dtype": "float32"}, {"shape": [64], "name": "fire2/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 64, 16], "name": "fire2/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [16], "name": "fire2/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 16, 64], "name": "fire3/expand1x1/kernel", "dtype": "float32"}, {"shape": [64], "name": "fire3/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 16, 64], "name": "fire3/expand3x3/kernel", "dtype": "float32"}, {"shape": [64], "name": "fire3/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 128, 16], "name": "fire3/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [16], "name": "fire3/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 32, 128], "name": "fire4/expand1x1/kernel", "dtype": "float32"}, {"shape": [128], "name": "fire4/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 32, 128], "name": "fire4/expand3x3/kernel", "dtype": "float32"}, {"shape": [128], "name": "fire4/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 128, 32], "name": "fire4/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [32], "name": "fire4/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 32, 128], "name": "fire5/expand1x1/kernel", "dtype": "float32"}, {"shape": [128], "name": "fire5/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 32, 128], "name": "fire5/expand3x3/kernel", "dtype": "float32"}, {"shape": [128], "name": "fire5/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 256, 32], "name": "fire5/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [32], "name": "fire5/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 48, 192], "name": "fire6/expand1x1/kernel", "dtype": "float32"}, {"shape": [192], "name": "fire6/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 48, 192], "name": "fire6/expand3x3/kernel", "dtype": "float32"}, {"shape": [192], "name": "fire6/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 256, 48], "name": "fire6/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [48], "name": "fire6/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 48, 192], "name": "fire7/expand1x1/kernel", "dtype": "float32"}, {"shape": [192], "name": "fire7/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 48, 192], "name": "fire7/expand3x3/kernel", "dtype": "float32"}, {"shape": [192], "name": "fire7/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 384, 48], "name": "fire7/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [48], "name": "fire7/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 64, 256], "name": "fire8/expand1x1/kernel", "dtype": "float32"}, {"shape": [256], "name": "fire8/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 256], "name": "fire8/expand3x3/kernel", "dtype": "float32"}, {"shape": [256], "name": "fire8/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 384, 64], "name": "fire8/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [64], "name": "fire8/squeeze1x1/bias", "dtype": "float32"}, {"shape": [1, 1, 64, 256], "name": "fire9/expand1x1/kernel", "dtype": "float32"}, {"shape": [256], "name": "fire9/expand1x1/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 256], "name": "fire9/expand3x3/kernel", "dtype": "float32"}, {"shape": [256], "name": "fire9/expand3x3/bias", "dtype": "float32"}, {"shape": [1, 1, 512, 64], "name": "fire9/squeeze1x1/kernel", "dtype": "float32"}, {"shape": [64], "name": "fire9/squeeze1x1/bias", "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.1", "model_config": {"config": {"name": "squeezenet", "layers": [{"config": {"name": "input_1", "sparse": false, "batch_input_shape": [1, 224, 224, 3], "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "conv1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "relu_conv1", "activation": "relu", "trainable": true}, "name": "relu_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "pool1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}, "name": "pool1", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 16, "name": "fire2/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire2/squeeze1x1", "inbound_nodes": [[["pool1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire2/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire2/relu_squeeze1x1", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "fire2/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire2/expand1x1", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "fire2/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire2/expand3x3", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire2/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire2/relu_expand1x1", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire2/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire2/relu_expand3x3", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire2/concat", "trainable": true, "axis": 3}, "name": "fire2/concat", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 16, "name": "fire3/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire3/squeeze1x1", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire3/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire3/relu_squeeze1x1", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "fire3/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire3/expand1x1", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "fire3/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire3/expand3x3", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire3/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire3/relu_expand1x1", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire3/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire3/relu_expand3x3", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire3/concat", "trainable": true, "axis": 3}, "name": "fire3/concat", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"name": "pool3", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}, "name": "pool3", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 32, "name": "fire4/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire4/squeeze1x1", "inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire4/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire4/relu_squeeze1x1", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 128, "name": "fire4/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire4/expand1x1", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 128, "name": "fire4/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire4/expand3x3", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire4/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire4/relu_expand1x1", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire4/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire4/relu_expand3x3", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire4/concat", "trainable": true, "axis": 3}, "name": "fire4/concat", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 32, "name": "fire5/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire5/squeeze1x1", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire5/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire5/relu_squeeze1x1", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 128, "name": "fire5/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire5/expand1x1", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 128, "name": "fire5/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire5/expand3x3", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire5/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire5/relu_expand1x1", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire5/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire5/relu_expand3x3", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire5/concat", "trainable": true, "axis": 3}, "name": "fire5/concat", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"name": "pool5", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}, "name": "pool5", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 48, "name": "fire6/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire6/squeeze1x1", "inbound_nodes": [[["pool5", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire6/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire6/relu_squeeze1x1", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 192, "name": "fire6/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire6/expand1x1", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 192, "name": "fire6/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire6/expand3x3", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire6/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire6/relu_expand1x1", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire6/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire6/relu_expand3x3", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire6/concat", "trainable": true, "axis": 3}, "name": "fire6/concat", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 48, "name": "fire7/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire7/squeeze1x1", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire7/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire7/relu_squeeze1x1", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 192, "name": "fire7/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire7/expand1x1", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 192, "name": "fire7/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire7/expand3x3", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire7/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire7/relu_expand1x1", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire7/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire7/relu_expand3x3", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire7/concat", "trainable": true, "axis": 3}, "name": "fire7/concat", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "fire8/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire8/squeeze1x1", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire8/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire8/relu_squeeze1x1", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 256, "name": "fire8/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire8/expand1x1", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 256, "name": "fire8/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire8/expand3x3", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire8/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire8/relu_expand1x1", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire8/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire8/relu_expand3x3", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire8/concat", "trainable": true, "axis": 3}, "name": "fire8/concat", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "name": "fire9/squeeze1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire9/squeeze1x1", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire9/relu_squeeze1x1", "activation": "relu", "trainable": true}, "name": "fire9/relu_squeeze1x1", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 256, "name": "fire9/expand1x1", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "fire9/expand1x1", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 256, "name": "fire9/expand3x3", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3]}, "name": "fire9/expand3x3", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "fire9/relu_expand1x1", "activation": "relu", "trainable": true}, "name": "fire9/relu_expand1x1", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire9/relu_expand3x3", "activation": "relu", "trainable": true}, "name": "fire9/relu_expand3x3", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"name": "fire9/concat", "trainable": true, "axis": 3}, "name": "fire9/concat", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"seed": null, "name": "drop9", "trainable": true, "rate": 0.5, "noise_shape": null}, "name": "drop9", "inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 1000, "name": "conv10", "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [1, 1]}, "name": "conv10", "inbound_nodes": [[["drop9", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"name": "relu_conv10", "activation": "relu", "trainable": true}, "name": "relu_conv10", "inbound_nodes": [[["conv10", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D"}, {"config": {"name": "loss", "activation": "softmax", "trainable": true}, "name": "loss", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Activation"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["loss", 0, 0]]}, "class_name": "Model"}}}
