{
    "backend": "tensorflow",
    "class_name": "Model",
    "keras_version": "2.1.1",
    "config": {
        "output_layers": [
            [
                "loss",
                0,
                0
            ]
        ],
        "name": "squeezenet",
        "layers": [
            {
                "inbound_nodes": [],
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "name": "input_1",
                    "sparse": false,
                    "dtype": "float32",
                    "batch_input_shape": [
                        null,
                        227,
                        227,
                        3
                    ]
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 64,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "conv1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "relu_conv1",
                "class_name": "Activation",
                "config": {
                    "name": "relu_conv1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "relu_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pool1",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "pool1",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "pool1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/squeeze1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 16,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire2/squeeze1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/relu_squeeze1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire2/relu_squeeze1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/expand1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 64,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire2/expand1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/expand3x3",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "same",
                    "filters": 64,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire2/expand3x3",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/expand1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/relu_expand1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire2/relu_expand1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/relu_expand3x3",
                "class_name": "Activation",
                "config": {
                    "name": "fire2/relu_expand3x3",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/relu_expand1x1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fire2/relu_expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire2/concat",
                "class_name": "Concatenate",
                "config": {
                    "name": "fire2/concat",
                    "axis": 3,
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire2/concat",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/squeeze1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 16,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire3/squeeze1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/relu_squeeze1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire3/relu_squeeze1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/expand1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 64,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire3/expand1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/expand3x3",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "same",
                    "filters": 64,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire3/expand3x3",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/expand1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/relu_expand1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire3/relu_expand1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/relu_expand3x3",
                "class_name": "Activation",
                "config": {
                    "name": "fire3/relu_expand3x3",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/relu_expand1x1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fire3/relu_expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire3/concat",
                "class_name": "Concatenate",
                "config": {
                    "name": "fire3/concat",
                    "axis": 3,
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire3/concat",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pool3",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "pool3",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "pool3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/squeeze1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 32,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire4/squeeze1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/relu_squeeze1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire4/relu_squeeze1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/expand1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 128,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire4/expand1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/expand3x3",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "same",
                    "filters": 128,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire4/expand3x3",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/expand1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/relu_expand1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire4/relu_expand1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/relu_expand3x3",
                "class_name": "Activation",
                "config": {
                    "name": "fire4/relu_expand3x3",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/relu_expand1x1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fire4/relu_expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire4/concat",
                "class_name": "Concatenate",
                "config": {
                    "name": "fire4/concat",
                    "axis": 3,
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire4/concat",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/squeeze1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 32,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire5/squeeze1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/relu_squeeze1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire5/relu_squeeze1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/expand1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 128,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire5/expand1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/expand3x3",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "same",
                    "filters": 128,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire5/expand3x3",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/expand1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/relu_expand1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire5/relu_expand1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/relu_expand3x3",
                "class_name": "Activation",
                "config": {
                    "name": "fire5/relu_expand3x3",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/relu_expand1x1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fire5/relu_expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire5/concat",
                "class_name": "Concatenate",
                "config": {
                    "name": "fire5/concat",
                    "axis": 3,
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire5/concat",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pool5",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "pool5",
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "pool5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/squeeze1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 48,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire6/squeeze1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/relu_squeeze1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire6/relu_squeeze1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/expand1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 192,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire6/expand1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/expand3x3",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "same",
                    "filters": 192,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire6/expand3x3",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/expand1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/relu_expand1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire6/relu_expand1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/relu_expand3x3",
                "class_name": "Activation",
                "config": {
                    "name": "fire6/relu_expand3x3",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/relu_expand1x1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "fire6/relu_expand3x3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire6/concat",
                "class_name": "Concatenate",
                "config": {
                    "name": "fire6/concat",
                    "axis": 3,
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire6/concat",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire7/squeeze1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 48,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire7/squeeze1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire7/squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire7/relu_squeeze1x1",
                "class_name": "Activation",
                "config": {
                    "name": "fire7/relu_squeeze1x1",
                    "activation": "relu",
                    "trainable": true
                }
            },
            {
                "inbound_nodes": [
                    [
                        [
                            "fire7/relu_squeeze1x1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fire7/expand1x1",
                "class_name": "Conv2D",
                "config": {
                    "use_bias": true,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "padding": "valid",
                    "filters": 192,
                    "kernel_regularizer": null,
                    "data_format": "channels_last",
                    "name": "fire7/expand1x1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "bias_constraint": null,
                    "activity_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
